hoaqua/backend/views/products/_form.php

SELECT * FROM `categories`
---
/* @var $this yii\web\View */
/* @var $model backend\models\products */
/* @var $form yii\widgets\ActiveForm */
$data=ArrayHelper::map(Categories::find()->all(), 'id', 'title');

SELECT * FROM `categories`
SELECT * FROM `brands`
---

<div class="products-form">
    <?php $form = ActiveForm::begin(['options'=>['enctype'=>'multipart/form-data']]);?>
    <?=$form->field($model, 'product_cat')->dropDownList(
    ArrayHelper::map(Categories::find()->all(), 'id', 'title'),
    [
        'prompt' => 'Chọn Danh mục',
    ]
)?>

    <?=$form->field($model, 'product_band')->dropDownList(
    ArrayHelper::map(Brands::find()->all(), 'id', 'brand_title'),
    [
        'prompt' => 'Chọn Nhà cung cấp',
    ]
)?>