hoaqua/backend/views/products/index.php

            'attribute' => 'product_cat',

            'content' => function ($model) {
                $Cate = Categories::find()->all();
---
SELECT * FROM `categories`

                'style' => 'width: 100px; text-align:center;',
            ],
        ],
        [
            'attribute' => 'product_band',
            // 'label'=>' Tên cột'
            'content' => function ($model) {
                $Cate = Brands::find()->all();
                foreach ($Cate as $key => $value) {
                    if($model->product_band == $value['id']){
                        return $model->product_band = $value['brand_title'];
                    }

                }
            },
            'headerOptions' =>
            [
                'style' => 'width: 100px; text-align:center;',
            ],
            'contentOptions' => [
                'style' => 'width: 100px; text-align:center;',
            ],
        ],
---
SELECT * FROM `brands`